Revit 2025 API
RailExtensionStyle Enumeration
 The extension style of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailExtensionStyle
Public Enumeration RailExtensionStyle
public enum class RailExtensionStyle
type RailExtensionStyle
Members
Member name | Value | Description
None | 0 |  The rail extends to nothing
Wall | 1 |  The rail extends to wall.
Floor | 2 |  The rail extends to floor.
Post | 3 |  The rail extends to post.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace